<?php

namespace App\Console\Commands;

use App\Models\Profession;
use App\Models\RatingQuestion;
use App\Models\Role;
use App\Models\Specialization;
use App\Models\User;
use App\Models\WebinarCategory;
use Illuminate\Console\Command;
use Illuminate\Support\Facades\DB;

class dbStartData extends Command
{
    /**
     * The name and signature of the console command.
     *
     * @var string
     */
    protected $signature = 'db-start-data';

    /**
     * The console command description.
     *
     * @var string
     */
    protected $description = 'Command description';

    public function handle()
    {
        User::insert(
            [
                'first_name' => 'admin',
                'second_name' => 'admin',
                'patronymic' => 'admin',
                'email' => 'admin@admin.ru',
                'phone' => '+7 (000) 000 0000',
                'role_id' => '1',
                'password' => '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi',
            ]
        );

        DB::table('regions')->insert([
            ['code' => '1', 'title' => 'Республика Адыгея (Адыгея)'],
            ['code' => '2', 'title' => 'Республика Башкортостан '],
            ['code' => '3', 'title' => 'Республика Бурятия '],
            ['code' => '4', 'title' => 'Республика Алтай '],
            ['code' => '5', 'title' => 'Республика Дагестан '],
            ['code' => '6', 'title' => 'Республика Ингушетия '],
            ['code' => '7', 'title' => 'Кабардино-Балкарская Республика '],
            ['code' => '8', 'title' => 'Республика Калмыкия '],
            ['code' => '9', 'title' => 'Карачаево-Черкесская Республика '],
            ['code' => '10', 'title' => 'Республика Карелия '],
            ['code' => '11', 'title' => 'Республика Коми '],
            ['code' => '12', 'title' => 'Республика Марий Эл'],
            ['code' => '13', 'title' => 'Республика Мордовия '],
            ['code' => '14', 'title' => 'Республика Саха (Якутия)'],
            ['code' => '15', 'title' => 'Республика Северная Осетия — Алания'],
            ['code' => '16', 'title' => 'Республика Татарстан (Татарстан)'],
            ['code' => '17', 'title' => 'Республика Тыва '],
            ['code' => '18', 'title' => 'Удмуртская Республика '],
            ['code' => '19', 'title' => 'Республика Хакасия '],
            ['code' => '21', 'title' => 'Чувашская Республика (Чувашия)'],
            ['code' => '22', 'title' => 'Алтайский край '],
            ['code' => '23', 'title' => 'Краснодарский край '],
            ['code' => '24', 'title' => 'Красноярский край '],
            ['code' => '25', 'title' => 'Приморский край '],
            ['code' => '26', 'title' => 'Ставропольский край '],
            ['code' => '27', 'title' => 'Хабаровский край '],
            ['code' => '28', 'title' => 'Амурская область '],
            ['code' => '29', 'title' => 'Архангельская область '],
            ['code' => '30', 'title' => 'Астраханская область '],
            ['code' => '31', 'title' => 'Белгородская область '],
            ['code' => '32', 'title' => 'Брянская область '],
            ['code' => '33', 'title' => 'Владимирская область '],
            ['code' => '34', 'title' => 'Волгоградская область '],
            ['code' => '35', 'title' => 'Вологодская область '],
            ['code' => '36', 'title' => 'Воронежская область '],
            ['code' => '37', 'title' => 'Ивановская область '],
            ['code' => '38', 'title' => 'Иркутская область '],
            ['code' => '39', 'title' => 'Калининградская область '],
            ['code' => '40', 'title' => 'Калужская область '],
            ['code' => '41', 'title' => 'Камчатский край '],
            ['code' => '42', 'title' => 'Кемеровская область '],
            ['code' => '43', 'title' => 'Кировская область '],
            ['code' => '44', 'title' => 'Костромская область '],
            ['code' => '45', 'title' => 'Курганская область '],
            ['code' => '46', 'title' => 'Курская область '],
            ['code' => '47', 'title' => 'Ленинградская область '],
            ['code' => '48', 'title' => 'Липецкая область '],
            ['code' => '49', 'title' => 'Магаданская область '],
            ['code' => '50', 'title' => 'Московская область '],
            ['code' => '51', 'title' => 'Мурманская область '],
            ['code' => '52', 'title' => 'Нижегородская область '],
            ['code' => '53', 'title' => 'Новгородская область '],
            ['code' => '54', 'title' => 'Новосибирская область '],
            ['code' => '55', 'title' => 'Омская область '],
            ['code' => '56', 'title' => 'Оренбургская область '],
            ['code' => '57', 'title' => 'Орловская область '],
            ['code' => '58', 'title' => 'Пензенская область '],
            ['code' => '59', 'title' => 'Пермский край '],
            ['code' => '60', 'title' => 'Псковская область '],
            ['code' => '61', 'title' => 'Ростовская область '],
            ['code' => '62', 'title' => 'Рязанская область '],
            ['code' => '63', 'title' => 'Самарская область '],
            ['code' => '64', 'title' => 'Саратовская область '],
            ['code' => '65', 'title' => 'Сахалинская область '],
            ['code' => '66', 'title' => 'Свердловская область '],
            ['code' => '67', 'title' => 'Смоленская область '],
            ['code' => '68', 'title' => 'Тамбовская область '],
            ['code' => '69', 'title' => 'Тверская область '],
            ['code' => '70', 'title' => 'Томская область '],
            ['code' => '71', 'title' => 'Тульская область '],
            ['code' => '72', 'title' => 'Тюменская область '],
            ['code' => '73', 'title' => 'Ульяновская область '],
            ['code' => '74', 'title' => 'Челябинская область '],
            ['code' => '75', 'title' => 'Забайкальский край '],
            ['code' => '76', 'title' => 'Ярославская область '],
            ['code' => '77', 'title' => 'Москва  '],
            ['code' => '78', 'title' => 'Санкт-Петербург  '],
            ['code' => '79', 'title' => 'Еврейская автономная область'],
            ['code' => '80', 'title' => 'Донецкая Народная Республика'],
            ['code' => '81', 'title' => 'Луганская Народная Республика'],
            ['code' => '82', 'title' => 'Республика Крым '],
            ['code' => '83', 'title' => 'Ненецкий автономный округ'],
            ['code' => '84', 'title' => 'Херсонская область '],
            ['code' => '85', 'title' => 'Запорожская область '],
            ['code' => '86', 'title' => 'Ханты-Мансийский автономный округ — Югра'],
            ['code' => '87', 'title' => 'Чукотский автономный округ'],
            ['code' => '89', 'title' => 'Ямало-Ненецкий автономный округ'],
            ['code' => '92', 'title' => 'Севастополь  '],
            ['code' => '95', 'title' => 'Чеченская республика '],
        ]);

        Role::insert([
            ['code' => 'admin', 'title' => 'Администратор'],
            ['code' => 'consultant', 'title' => 'Консультант'],
            ['code' => 'parented', 'name' => 'Родитель'],
        ]);

        Specialization::insert([
            ['title' => 'Дошкольники (3-7 лет)'],
            ['title' => 'Младший школьный возраст (7-12 лет)'],
            ['title' => 'Младший подростковый возраст (12-15 лет)'],
            ['title' => 'Старший подростковый возраст (15-18 лет)'],
            ['title' => 'Дети с ОВЗ'],
            ['title' => 'Вопросы правового характера, связанные с воспитанием и обучением детей'],
        ]);

        Profession::insert([
            ['title' => 'Преподаватель ВГСПУ'],
            ['title' => 'Специалист из ОУ'],
        ]);

        WebinarCategory::insert([
            ['title' => 'Всероссийская неделя родительской компетентности'],
            ['title' => 'Родительский университет'],
            ['title' => 'Школа ответсвенного родителя'],
        ]);

        DB::table('rating_questions')->insert([
            ["title" => "Удовлетворены ли Вы качеством оказанной услуги? Соответствовало ли содержание консультации имеющейся проблеме, помог ли консультант Межрегиональной службы консультирования родителей ВГСПУ?", "type" => RatingQuestion::RATING_NUMBER],
            ["title" => "Удовлетворены ли Вы условиями предоставления услуги (оценивается доступность для людей с ОВЗ, доступность записи, время ожидания от момента обращения, возможность выбора формата оказания услуги)?", "type" => RatingQuestion::RATING_NUMBER],
            ["title" => "Удовлетворены ли Вы полнотой и доступностью информации о работе Службы и порядке предоставления услуг ? (при личном обращении, по телефону, на официальном сайте организации, на сайте https://roditel-vspu.ru/, на информационных стендах)", "type" => RatingQuestion::RATING_NUMBER],
            ["title" => "Оцените доброжелательность и вежливость консультантов Службы", "type" => RatingQuestion::RATING_NUMBER],
            ["title" => "Есть ли у Вас жалобы на работу Межрегиональной службы консультирования родителей ВГСПУ?", "type" => RatingQuestion::RATING_TEXT],
            ["title" => "Есть ли у Вас предложения и пожелания по улучшению работы Межрегиональной службы консультирования родителей ВГСПУ?", "type" => RatingQuestion::RATING_TEXT],
        ]);
    }
}
